LES_Data/OFfiles/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
14751
(
3.034000089741324
3.034000124510496
3.034000026634675
3.033999949549799
3.033999892463884
3.033999845106867
3.03399979280616
3.033999764820312
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1
0.9981176030000001
0.9882624724500002
0.9627578342999999
0.9176993420999999
0.8558293050999998
0.78342766405
0.7064703305499999
...
)
;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
3.036
3.036
3.036
3.036
3.036
3.036
3.036
3.036
...
)
;
    }
}


// ************************************************************************* //
