LES_Data/OFfiles/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.00000001";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
14751
(
1.543694797689695e-06
1.539216564431299e-06
1.537070385626648e-06
1.532622647686847e-06
1.528768442509869e-06
1.523772410807327e-06
1.518571481000853e-06
1.512825469270419e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 1e-16;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 1e-16;
    }
}


// ************************************************************************* //
