LES_Data/OFfiles/0/profileRefFieldInversionAll
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.00000528";
    object      profileRefFieldInversionAll;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
14751
(
10000000000000000
10000000000000000
10000000000000000
10000000000000000
10000000000000000
10000000000000000
10000000000000000
10000000000000000
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 1e+16;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           uniform 1e+16;
    }
}


// ************************************************************************* //
