LES_Data/OFfiles/0/ub
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ub;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
14751
(
6.2953419982765046e-02
6.6747657954692841e-02
6.8672746419906616e-02
7.0749983191490173e-02
7.3107138276100159e-02
7.5648263096809373e-02
7.8222498297691345e-02
8.0776840448379517e-02
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 1e+16;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           uniform 1e+16;
    }
}